<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"c461fc5e1be843ed1b36d1bd754ea644dfa6ad55c9a0c5dbe5de6268184e10ed","plan_job_ref":"Job Plan Airflow DAGs #9 at https://github.com/cal-itp/data-infra/actions/runs/14599688654","plan_out_hash":"e9a7e2b1dcea26c28e986f37cb5de0dd4453ac1afb11b7c9cca6968218c4c42b","plan_hash":"986140c4edf1448af02480280b3b8a7d4d238f5089c6d83170fe84ea45a0756a","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 3 to add, 0 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_ntd_data_xlsx/assets/asset_inventory_time_series.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/sync_ntd_data_xlsx/assets/asset_inventory_time_series.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/sync_ntd_data_xlsx/assets/asset_inventory_time_series.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_ntd_data_xlsx/scrape_ntd_xlsx_urls.py"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "vZpfKw==" -> (known after apply)
!~      detect_md5hash      = "RDEJ2LSzI0WWGWuMmcTQBQ==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "***********************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "RDEJ2LSzI0WWGWuMmcTQBQ==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fsync_ntd_data_xlsx%2Fscrape_ntd_xlsx_urls.py?generation=1744830290508000&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/sync_ntd_data_xlsx/scrape_ntd_xlsx_urls.py"
!~      output_name         = "dags/sync_ntd_data_xlsx/scrape_ntd_xlsx_urls.py" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fsync_ntd_data_xlsx%2Fscrape_ntd_xlsx_urls.py" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/scrape_ntd_xlsx.py"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "kaZamQ==" -> (known after apply)
!~      detect_md5hash      = "+JM82+m8nX8ujeA4Ofe5sw==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "+JM82+m8nX8ujeA4Ofe5sw==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/plugins%2Foperators%2Fscrape_ntd_xlsx.py?generation=1744830294083727&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "plugins/operators/scrape_ntd_xlsx.py"
!~      output_name         = "plugins/operators/scrape_ntd_xlsx.py" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/plugins%2Foperators%2Fscrape_ntd_xlsx.py" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #9](https://github.com/cal-itp/data-infra/actions/runs/14599688654)